function pizza() {
   alert("ברוכים הבאים לאבא פיצה!");
   let a = prompt("איזו פיצה תרצה להזמין מרינרה או מרגריטה?");
   if (a == "מרינרה") {
      let c = prompt(
         "רוטב עגבניות, שום, שמן זית ואוריגנו. זה בסדר או להוריד משהו ?"
      );
      if (c == "בסדר") {
         alert(
            "אחלה! ההזמנה שלך יוצאת לדרך: פיצה מרינרה - עם רוטב עגבניות, שום, שמן זית ואוריגנו "
         );
      } else if (c == "להוריד") {
         let b = prompt("מה להוריד? רוטב עגבניות, שום, שמן זית או אוריגנו?");
         if (b == "רוטב עגבניות") {
            alert("אחלה! ההזמנה שלך: פיצה מרינרה עם שום, שמן זית ואוריגנו.");
         } else if (b == "שום") {
            alert(
               "אחלה! ההזמנה שלך: פיצה מרינרה עם רוטב עגבניות, שמן זית ואוריגנו."
            );
         } else if (b == "שמן זית") {
            alert(
               "אחלה! ההזמנה שלך: פיצה מרינרה עם רוטב עגבניות, שום ואוריגנו."
            );
         } else if (b == "אוריגנו") {
            alert(
               "אחלה! ההזמנה שלך: פיצה מרינרה עם רוטב עגבניות, שום ושמן זית ."
            );
         } else {
            alert("ניתן להוריד רק מרכיב אחד");
            pizza();
         }
      } else {
         alert("תבחר רק מהרשימה");
         pizza();
      }
   } else if (a == "מרגריטה") {
      let d = prompt(
         "רוטב מעגבניות, גבינת מוצרלה עלי בזיליקום, שמן זית, זה בסדר או להוריד משהו?"
      );
      if (d == "בסדר") {
         alert(
            "אחלה! ההזמנה שלך יוצאת לדרך: פיצה מרגריטה - עם רוטב מעגבניות, גבינת מוצרלה עלי בזיליקום, שמן זית. "
         );
      } else if (d == "להוריד") {
         let e = prompt(
            "?מה להוריד: רוטב עגבניות, גבינת מוצרלה, עלי בזיליקום, שמן זית"
         );

         if (e == "רוטב עגבניות") {
            alert(
               "אחלה! ההזמנה שלך: פיצה מרגריטה עם גבינת מוצרלה, עלי בזיליקום ושמן זית ."
            );
         } else if (e == "גבינת מוצרלה") {
            alert(
               "אחלה! ההזמנה שלך: פיצה מרגריטה עם רוטב עגבניות, עלי בזיליקום, ושמן זית"
            );
         } else if (e == "עלי בזיליקום") {
            alert(
               "אחלה! ההזמנה שלך: פיצה מרגריטה עם רוטב עגבניות, גבינת מוצרלה ושמן זית!"
            );
         } else if (e == "שמן זית") {
            alert(
               "אחלה! ההזמנה שלך: פיצה מרגריטה עם רוטב עגבניות, גבינת מוצרלה ועלי בזיליקום!"
            );
         } else {
            alert("ניתן להוריד רק מרכיב אחד");

            pizza();
         }
      } else {
         alert("תבחר מהרשימה");
         pizza();
      }
   } else {
      alert("תבחר מהרשימה");
      pizza();
   }
}
function hamburger() {
   alert("ברוכים הבאים לאבא המבורגר מיד תעברו להזמנה!");
   let a = prompt("אנא בחר גודל ההמבורגר 220 או 300 גרם ?");
   if (a == "300") {
      let b = prompt("אנא בחר מידת העשייה: מדיום או וול דן");
      if (b == "מדיום") {
         let c = prompt("תרצה ירקות ?");
         if (c == "כן") {
            let d = prompt(
               "עגבנייה, מלפפון, חסה, בצל. זה בסדר או להוריד משהו?"
            );
            if (d == "בסדר") {
               alert(
                  "אחלה! ההזמנה שלך: המבורגר 300 גרם מידת העשייה: מדיום, עם עגבנייה, מלפפון, חסה ובצל!,"
               );
            } else if (d == "להוריד") {
               let e = prompt("איזה ירקות להוריד? עגבניה, מלפפון, חסה או בצל?");
               if (e == "עגבנייה") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 300 גרם מידת העשייה: מדיום, עם מלפפון, חסה ובצל!,"
                  );
               } else if (e == "מלפפון") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 300 גרם מידת העשייה: מדיום, עם עגבנייה, חסה ובצל!,"
                  );
               } else if (e == "חסה") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 300 גרם מידת העשייה: מדיום, עם עגבנייה, מלפפון ובצל!,"
                  );
               } else if (e == "בצל") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 300 גרם מידת העשייה: מדיום, עם עגבנייה, מלפפון וחסה!,"
                  );
               } else {
                  alert("תבחר פריט אחד מהרשימה בלבד");
                  hamburger();
               }
            }
         } else if (c == "לא") {
            alert(
               "אחלה! ההזמנה שלך: המבורגר 300 גרם מידת העשייה: מדיום ללא ירקות!"
            );
         } else {
            alert("תבחר מהרשימה");
            hamburger();
         }
      } else if (b == "וול דן") {
         let f = prompt("תרצה ירקות ?");
         if (f == "כן") {
            let g = prompt(
               "עגבנייה, מלפפון, חסה, בצל. זה בסדר או להוריד משהו?"
            );
            if (g == "בסדר") {
               alert(
                  "אחלה! ההזמנה שלך: המבורגר 300 גרם מידת העשייה: וול דן, עם עגבנייה, מלפפון, חסה ובצל!,"
               );
            } else if (g == "להוריד") {
               let h = prompt("איזה ירקות להוריד? עגבניה, מלפפון, חסה או בצל?");
               if (h == "עגבנייה") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 300 גרם מידת העשייה: וול דן, עם מלפפון, חסה ובצל!,"
                  );
               } else if (h == "מלפפון") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 300 גרם מידת העשייה: וול דן, עם עגבנייה, חסה ובצל!,"
                  );
               } else if (h == "חסה") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 300 גרם מידת העשייה: וול דן, עם עגבנייה, מלפפון ובצל!,"
                  );
               } else if (h == "בצל") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 300 גרם מידת העשייה: וול דן, עם עגבנייה, מלפפון וחסה!,"
                  );
               } else {
                  alert("תבחר פריט אחד מהרשימה בלבד");
                  hamburger();
               }
            }
         } else if (f == "לא") {
            alert(
               "אחלה! ההזמנה שלך: המבורגר 300 גרם, מידת העשייה: וול דן, ללא ירקות!"
            );
         } else {
            alert("תבחר רק מהרשימה");
            hamburger();
         }
      } else {
         alert("תבחר מהרשימה");
         hamburger();
      }
   } else if (a == "220") {
      let i = prompt("אנא בחר מידת העשייה: מדיום או וול דן");
      if (i == "מדיום") {
         let j = prompt("תרצה ירקות ?");
         if (j == "כן") {
            let k = prompt(
               "עגבנייה, מלפפון, חסה, בצל. זה בסדר או להוריד משהו?"
            );
            if (k == "בסדר") {
               alert(
                  "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: מדיום, עם עגבנייה, מלפפון, חסה ובצל!,"
               );
            } else if (k == "להוריד") {
               let m = prompt("איזה ירקות להוריד? עגבניה, מלפפון, חסה או בצל?");
               if (m == "עגבניה") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: מדיום, עם מלפפון, חסה ובצל!,"
                  );
               } else if (m == "מלפפון") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: מדיום, עם עגבנייה, חסה ובצל!,"
                  );
               } else if (m == "חסה") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: מדיום, עם עגבנייה, מלפפון ובצל!,"
                  );
               } else if (m == "בצל") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: מדיום, עם עגבנייה, מלפפון וחסה!,"
                  );
               } else {
                  alert("תבחר פריט אחד מהרשימה ");
                  hamburger();
               }
            } else {
               alert("בסדר או להוריד");
               hamburger();
            }
         } else if (j == "לא") {
            alert(
               "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: מדיום ללא ירקות!"
            );
         } else {
            alert("רק כן או לא");
            hamburger();
         }
      } else if (i == "וול דן") {
         let n = prompt("תרצה ירקות ?");
         if (n == "כן") {
            let l = prompt(
               "עגבנייה, מלפפון, חסה, בצל. זה בסדר או להוריד משהו?"
            );
            if (l == "בסדר") {
               alert(
                  "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: מדיום, עם עגבניה, מלפפון, חסה ובצל!,"
               );
            } else if (l == "להוריד") {
               let o = prompt("איזה ירקות להוריד? עגבניה, מלפפון, חסה או בצל?");
               if (o == "עגבניה") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: וול דן, עם מלפפון, חסה ובצל!,"
                  );
               } else if (o == "מלפפון") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: וול דן, עם עגבניה, חסה ובצל!,"
                  );
               } else if (o == "חסה") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: וול דן, עם עגבניה, מלפפון ובצל!,"
                  );
               } else if (o == "בצל") {
                  alert(
                     "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: וול דן, עם עגבניה, מלפפון וחסה!,"
                  );
               } else {
                  alert("תבחר מהרשימה פריט אחד בלבד");
                  hamburger();
               }
            } else {
               alert("תבחר מהרשימה");
               hamburger();
            }
         } else if (n == "לא") {
            alert(
               "אחלה! ההזמנה שלך: המבורגר 220 גרם מידת העשייה: וול דן ללא ירקות!"
            );
         } else {
            alert("תבחר מהרשימה");
            hamburger();
         }
      } else {
         alert("תבחר מהרשימה");
         hamburger();
      }
   } else {
      alert("תבחר מהרשימה");
      hamburger();
   }
}
